index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>GSRI package: Gene Set Regulation Index</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-07-28 23:40:11 CEST"/>
<meta name="author" content="Julian Gehring"/>
<meta name="description" content="GSRI page"/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="http://julian-gehring.github.com/worg.css" />
<link title="GSRI package - Feed" href="https://github.com/julian-gehring/GSRI/commits/gh-pages.atom" type="application/atom+xml" rel="alternate" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">GSRI package: Gene Set Regulation Index</h1>






<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Summary </a></li>
<li><a href="#sec-2">Methodology </a></li>
<li><a href="#sec-3">Availability, source code, and licensing </a></li>
<li><a href="#sec-4">Usage </a>
<ul>
<li><a href="#sec-4-1">Installation </a></li>
<li><a href="#sec-4-2">Loading the package </a></li>
<li><a href="#sec-4-3">Documentation </a></li>
</ul>
</li>
<li><a href="#sec-5">Contact and contribution </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Summary </h2>
<div class="outline-text-2" id="text-1">


<p>
  The GSRI package estimates the number of differentially expressed genes in gene sets, utilizing the concept of the Gene Set Regulation Index (GSRI).
</p>
<p>
  Authors: Julian Gehring, Kilian Bartholomé, Clemens Kreutz, Jens Timmer<br/>
  Maintainer: Julian Gehring &lt;julian.gehring (at) fdm.uni-freiburg.de&gt;
</p>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Methodology </h2>
<div class="outline-text-2" id="text-2">


<p>  
  For a detailed description of the approach, a comparison to other methods, and an application to experimental data, please see the paper:
</p>
<blockquote>

<p>Kilian Bartholomé, Clemens Kreutz, Jens Timmer:<br/>
<a href="http://www.liebertonline.com/doi/abs/10.1089/cmb.2008.0226">Estimating of gene induction enables a relevance-based ranking of genes sets</a><br/>
J. Comp. Biol. 16, 2009, 959-967  
</p>
</blockquote>



</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Availability, source code, and licensing </h2>
<div class="outline-text-2" id="text-3">


<p>
  The <i>GSRI</i> package is written for <a href="http://www.r-project.org/">R</a> and part of the <a href="http://bioconductor.org">bioconductor</a> project since the 2.6 release in April 2010. This provides the latest <a href="http://www.bioconductor.org/help/bioc-views/release/bioc/html/GSRI.html">stable release version</a> and the current <a href="http://www.bioconductor.org/help/bioc-views/devel/bioc/html/GSRI.html">developer version</a>, including builts for major platforms supported by R.
</p>
<p>
  The complete source code of the package is publically accessible at <a href="https://github.com/julian-gehring/GSRI">github</a> and licenced under the <a href="http://www.gnu.org/licenses/gpl-3.0.html">General Public License version 3 (GPL-3)</a>. You are free to use the software for any purposes and you are also welcome to contribute to it in any way.
</p>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Usage </h2>
<div class="outline-text-2" id="text-4">



</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">Installation </h3>
<div class="outline-text-3" id="text-4-1">


<p>
   In order to install the latest stable version of the <i>GSRI</i> package from the bioconductor repository, simply run in your R session:
</p>



<pre class="src src-R">   <span style="color: #008b8b;">source</span>(<span style="color: #8b2252;">"http://bioconductor.org/biocLite.R"</span>)
   biocLite(<span style="color: #8b2252;">"GSRI"</span>)
</pre>




<p>
   Alternatively, you can also obtain the built packages from bioconductor and install them manually:
</p>



<pre class="src src-R">   install.packages(<span style="color: #8b2252;">"path/to/GSRI_x.y.z"</span>)
</pre>




<p>
   Please note that the first method is generally the best choice.
</p>

</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2">Loading the package </h3>
<div class="outline-text-3" id="text-4-2">


<p>   
   After the package has been installed, you can load it:
</p>



<pre class="src src-R">   <span style="color: #008b8b;">library</span>(GSRI)
</pre>





</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3">Documentation </h3>
<div class="outline-text-3" id="text-4-3">


<p>
   A comprehensive example session on how to analyze gene sets with the <i>GSRI</i> package can be found in the <a href="doc/gsri_vignette.html">vignette</a> of the package. This can also be assessed as a pdf file from the <a href="http://www.bioconductor.org/packages/release/bioc/vignettes/GSRI/inst/doc/gsri.pdf">bioconductor website</a> or within R:
</p>



<pre class="src src-R">   vignette(<span style="color: #8b2252;">"gsri"</span>)
</pre>




<p>
   Detailed descriptions of the objects, functions, and their parameters are provided in the <a href="http://www.bioconductor.org/packages/release/bioc/manuals/GSRI/man/GSRI.pdf">help pages</a>. For details about individual parts, e.g. the <i>gsri</i> method, you can read the help file within R:
</p>



<pre class="src src-R">   ?gsri
</pre>





</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Contact and contribution </h2>
<div class="outline-text-2" id="text-5">


<p>
  If you have any questions, comments, or contributions:
</p><ul>
<li>Contact the maintainer via e-mail.
</li>
<li>Report issues to the <a href="https://github.com/julian-gehring/GSRI/issues">issue tracker</a>.
</li>
<li>Fork the <a href="https://github.com/julian-gehring/GSRI">project repository</a>.
</li>
</ul>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2011-07-28 23:40:11 CEST</p>
<p class="author">Author: Julian Gehring</p>


</div>
</body>
</html>
